KanatERPSukhova.КанатАдаптация/src/InformationRegisters/КАНАТ_ЛицаПодписывающиеЗаПодразделения/КАНАТ_ЛицаПодписывающиеЗаПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КАНАТ_ЛицаПодписывающиеЗаПодразделения</name>
  <dimensions>
    <name>РольРуководителя</name>
    <type>
      <types>EnumRef.КАНАТ_РолиПодписантов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Замещающий</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/КАНАТ_ЛицаПодписывающиеЗаПодразделения/ManagerModule.bsl
Функция ПолучитьСотрудникаПоДолжности(Должность, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		
		Дата = ТекущаяДата();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КАНАТ_ЛицаПодписывающиеЗаПодразделения.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения КАК КАНАТ_ЛицаПодписывающиеЗаПодразделения
		|ГДЕ
		|	КАНАТ_ЛицаПодписывающиеЗаПодразделения.РольРуководителя.Ссылка = &Должность
		|	И КАНАТ_ЛицаПодписывающиеЗаПодразделения.ДатаНачала <= &Дата
		|	И КАНАТ_ЛицаПодписывающиеЗаПодразделения.ДатаОкончания > &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Должность", Должность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сотрудник;
	Иначе
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
